Revit 2026 API

# DisplacementElementCanCategoryBeDisplaced Method

---

Indicates whether elements of the specified category are eligible as displaced elements.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CanCategoryBeDisplaced(
	ElementId categoryId
)
```
```vb
Public Shared Function CanCategoryBeDisplaced (
	categoryId As ElementId
) As Boolean
```
```cpp
public:
static bool CanCategoryBeDisplaced(
	ElementId^ categoryId
)
```
```fsharp
static member CanCategoryBeDisplaced :
        categoryId : ElementId -> bool
```

#### Parameters

categoryId ElementId
     Category id of element to be replaced.

#### Return Value

Boolean Returns true if elements of this category can be displaced, and false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Elements may be disallowed as displaced elements for reasons other than their category.

#### Reference

DisplacementElement Class

Autodesk.Revit.DB Namespace